class MoneyBox:
    def __init__(self, capacity):
        # Ініціалізація об'єкту скарбнички з вказаною місткістю та нульовою кількістю монет
        self.capacity = capacity
        self.coins = 0

    def can_add(self, v):
        # Перевірка, чи можна додати вказану кількість монет до скарбнички
        return self.coins + v <= self.capacity

if __name__ == "__main__":
    # Зчитування місткості та кількості вже покладених монет з консолі
    n = int(input("Введіть місткість скарбнички: "))
    m = int(input("Скільки монет поклали в скарбничку: "))

    # Створення об'єкту скарбнички та ініціалізація кількості монет
    box = MoneyBox(n)
    box.coins = m

    # Зчитування кількості монет, які хочуть покласти в скарбничку
    k = int(input("Скільки монет хочуть покласти в скарбничку: "))

    # Перевірка, чи можна додати вказану кількість монет до скарбнички та виведення результату
    result = box.can_add(k)

    if result:
        print("True")
    else:
        print("False")