def printed(animals):
    for animal, characteristics in animals.items():
        print(f"Тварина: {animal}")
        print(f"Кількість лап: {characteristics['кількість лап']}")
        print(f"Кольори: {', '.join(characteristics['кольори'])}")
        print(f"Середня тривалість життя: {characteristics['середня тривалість життя']} років")
        print(20*"_-")
animals = {
    'кіт': {
        'кількість лап': 4,
        'кольори': ['сірий', 'чорний', 'білий'],
        'середня тривалість життя': 15
    },
    'собака': {
        'кількість лап': 4,
        'кольори': ['рудий', 'чорний', 'білий'],
        'середня тривалість життя': 12
    },
    'папуга': {
        'кількість лап': 2,
        'кольори': ['зелений', 'жовтий', 'червоний'],
        'середня тривалість життя': 10
    }
}

printed(animals)
try:
    animals.pop('папуга')
    print("Словник після видалення папуги")
except KeyError:
    print("Тварину  не знайдено у словнику")
printed(animals)
try:
    animals['кіт']['кольори'][0] = 'коричневий'
    animals['собака']['середня тривалість життя']=20
    print("Словник після зміни кольору кота і тривалості життя собаки")
except KeyError:
    print("Тварину або характеристики не знайдено у словнику")
printed(animals)

animals['єнот']={'кількість лап': 4,
        'кольори': ['сірий', 'чорний', 'коричневий'],
        'середня тривалість життя': 11}
print("Словник після додавання тварини")
printed(animals)